[
    {
        "title": "ADA Digital Accessibility on Academic Library Websites",
        "authors": ["Yan Quan Liu", "Arlene Bielefield", "Jennifer Beckwith"],
        "publication": "College & Research Libraries",
        "volume": 85,
        "issue": 2,
        "pages": "166-186",
        "year": 2024,
        "abstract": "Studying ADA accessibility at library websites of top universities selected from the 'U.S. News and World Report,' the authors used WAVE and AChecker to assess data in compliance with WCAG 2.0 standards. Almost 8 out of 10 public university academic libraries reported accessibility errors as one of the major findings. Low color contrast was becoming a more commonly occurring accessibility issue, making it difficult for people with vision impairments to perceive the color of the image. The outcomes of the study suggest that academic libraries around the world should continue improving their website accessibility."
    },
    {
        "title": "Our Students…Our Campus…Their Community: Analyzing Institutional Civic Engagement Websites",
        "authors": ["Quortne R. Hutchings", "Demetri L. Morgan"],
        "publication": "Innovative Higher Education",
        "volume": 49,
        "issue": 1,
        "pages": "25-48",
        "year": 2024,
        "abstract": "Literature suggests that institutional efforts to cultivate civic engagement may have developmental importance on an institution's mission, values, and culture. This study seeks to detail how anchor and place-based justice network institutions digitally engage with their communities through a website content analysis and using Ostrander's civic engagement framework and Kimball and Thomas' place-building theory. Findings from this study illuminated the contrasting and overlapping strategies anchor, and place-based justice network websites address advancing civic engagement. Through our analysis, we offer an innovative theoretical and practical institutional civic and community engagement website approach for strengthening institutional websites called 'Digital Place-Based Theory for Social Justice.' This study will help scholars and practitioners explore the relationship between sustainable partnerships with local communities and post-secondary institutional responses to ever-evolving justice concerns."
    },
    {
        "title": "Websites That Support Guided Pathways Partnerships",
        "authors": ["Patel, Hezal", "Brosnan, Marianne J."],
        "publication": "New Directions for Community Colleges",
        "issue": 198,
        "pages": "93-106",
        "season": "Summer",
        "year": 2022,
        "abstract": "The authors examine trends in how successful guided pathways colleges communicate transfer options to 4-year institutions via their institutional websites so that students--the ultimate benefactors of guided pathways initiatives--can discover and pursue the transfer partnership pathways. Institutions in the two states included in this review were selected based on nationally recognized exemplary practices and commitment to student success and outcomes. Three dimensions were explored in this website content analysis: How easy is it to find information (accessibility)? How is the information organized (presentation)? What relevant content is communicated (information)? The authors found that exemplary pathways institutions place pathways information prominently on their websites' home page, use similar language to describe pathways information and in multiple places on the website, and provide a connection to supportive transfer resources. The authors present the conclusions, discuss implications drawn from this study, and provide recommendations for practice."
    },
    {
        "title": "Websites That Support Guided Pathways Partnerships",
        "authors": ["Patel, Hezal", "Brosnan, Marianne J."],
        "publication": "New Directions for Community Colleges",
        "issue": 198,
        "pages": "93-106",
        "season": "Summer",
        "year": 2022,
        "abstract": "The authors examine trends in how successful guided pathways colleges communicate transfer options to 4-year institutions via their institutional websites so that students--the ultimate benefactors of guided pathways initiatives--can discover and pursue the transfer partnership pathways. Institutions in the two states included in this review were selected based on nationally recognized exemplary practices and commitment to student success and outcomes. Three dimensions were explored in this website content analysis: How easy is it to find information (accessibility)? How is the information organized (presentation)? What relevant content is communicated (information)? The authors found that exemplary pathways institutions place pathways information prominently on their websites' home page, use similar language to describe pathways information and in multiple places on the website, and provide a connection to supportive transfer resources. The authors present the conclusions, discuss implications drawn from this study, and provide recommendations for practice."
    }
]